app/controllers/projects_controller.rb

 def create
    @project = current_user.projects.build(project_params)

    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("name", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Stimulus Refelx"], ["description", "aaaa"], ["user_id", 1], ["created_at", "2020-12-14 09:44:23.521550"], ["updated_at", "2020-12-14 09:44:23.521550"]]

    def set_project
      @project = current_user.projects.find(params[:id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = ? AND "projects"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]