app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("name", "status", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Learn Stimulus reflex"], ["status", "not-started"], ["project_id", 1], ["created_at", "2020-12-14 09:44:29.669380"], ["updated_at", "2020-12-14 09:44:29.669380"]]
---
  def create
    @task = @project.tasks.build(task_params)

    if @task.save

UPDATE "tasks" SET "description" = ?, "updated_at" = ? WHERE "tasks"."id" = ?
---
  def update
    if @task.update_attributes(task_params)

SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = ? AND "projects"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
---
    def set_project
      @project = current_user.projects.find(params[:project_id])

SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = ? AND "tasks"."id" = ? LIMIT ?  [["project_id", 1], ["id", 1], ["LIMIT", 1]]
---
    def set_task
      @task = @project.tasks.find(params[:id])